
import { DrugDB, Reasons, FoodInference } from './types';

export const DRUG_DB: DrugDB = {
  "아세트아미노펜": {
    "상품명": ["타이레놀", "타세놀", "게보린", "펜잘"],
    "주의식재료": ["비타민C", "식이섬유", "오트밀", "시리얼", "에키나시아"]
  },
  "이부프로펜": {
    "상품명": ["애드빌", "이지엔6 애니", "부루펜", "그날엔"],
    "주의식재료": ["카페인", "마늘", "생강"]
  },
  "나프록센": {
    "상품명": ["탁센", "이지엔6 스트롱", "낙센", "페인엔젤 센"],
    "주의식재료": ["카페인", "마늘", "생강", "인삼", "은행엽"]
  }
};

export const REASONS: Reasons = {
  "비타민C": "독성 증가 위험(3g 이상 금지)",
  "식이섬유": "약물 흡수 방해 및 효과 지연",
  "오트밀": "약물 흡수 방해 및 효과 지연",
  "시리얼": "약물 흡수 방해 및 효과 지연",
  "카페인": "위산 역류 및 위장관 출혈 위험",
  "마늘": "혈액 응고 방해로 인한 출혈 위험",
  "생강": "지혈 방해 및 출혈 위험 증가",
  "인삼": "출혈 위험성을 증가시킬 수 있습니다.",
  "은행엽": "지혈 방해로 인한 출혈 위험"
};

export const FOOD_INFERENCE: FoodInference = {
  "비빔밥": ["식이섬유", "마늘"],
  "나물": ["식이섬유", "마늘"],
  "봄동": ["식이섬유", "마늘"],
  "콩나물": ["식이섬유", "마늘"],
  "시금치": ["식이섬유"],
  "상추쌈": ["식이섬유"],
  "쌈": ["식이섬유"],
  "배추": ["식이섬유"],
  "상추": ["식이섬유"],
  "스틱채소": ["식이섬유"],
  "미역": ["식이섬유"],
  "샐러드": ["식이섬유", "비타민C"],
  "치킨": ["마늘"],
  "통닭": ["마늘"],
  "불고기": ["마늘"],
  "김치찌개": ["마늘"],
  "된장찌개": ["마늘"],
  "잡채": ["식이섬유"],
  "아메리카노": ["카페인"],
  "커피": ["카페인"],
  "초콜릿": ["카페인"],
  "초코": ["카페인"],
  "콜라": ["카페인"],
  "에너지드링크": ["카페인"],
  "삼계탕": ["인삼"],
  "브라우니": ["카페인"],
  "야채": ["식이섬유"],
  "채소": ["식이섬유"]
};
